In [8]:
import pandas as pd 

df = pd.read_csv('credit.csv')
print(df)

# print(df['나이'].mean()) # 평균 나이값
# print(df['나이'].mode()) # 최빈값
# print(df['나이'].max()) # 최대값
# print(df['나이'].min()) # 최소값
# print(df['나이'].describe()) # 빠른통계

# dataframe # 판다스에서 다루는 dataframe 자료형 2차원 데이터  가로세로 열 이있는 데이터를 뜻함
# Series # 1차원 데이터, 컬럼 이라고 생각하면됌

     나이 성별           학력       기혼              소득  사용금액  사용횟수
0    45  M  High School  Married     $60K - $80K  1144    42
1    49  F     Graduate   Single  Less than $40K  1291    33
2    51  M     Graduate  Married    $80K - $120K  1887    20
3    40  F  High School  Unknown  Less than $40K  1171    20
4    40  M   Uneducated  Married     $60K - $80K   816    28
..   .. ..          ...      ...             ...   ...   ...
195  47  F  High School  Married  Less than $40K  1002    22
196  41  M  High School  Unknown         $120K +  1344    21
197  53  M   Uneducated  Married    $80K - $120K  1461    42
198  68  M  High School  Married  Less than $40K   760    21
199  44  F     Graduate  Married    $80K - $120K  1316    25

[200 rows x 7 columns]

In [14]:
# 원하는 데이터만 필터 주기
# df[df['나이'] > 50]

# 여러개 필터 조건문 줄때
df.query("나이 > 50 and 기혼 == 'Married' ")

     나이 성별             학력       기혼              소득  사용금액  사용횟수
2    51  M       Graduate  Married    $80K - $120K  1887    20
6    51  M        Unknown  Married         $120K +  1330    31
11   65  M        Unknown  Married     $40K - $60K  1314    26
14   57  F       Graduate  Married  Less than $40K  1570    29
18   61  M    High School  Married     $40K - $60K  1336    30
..   .. ..            ...      ...             ...   ...   ...
192  57  F       Graduate  Married  Less than $40K  1771    37
193  54  M      Doctorate  Married         $120K +  1873    52
194  51  F  Post-Graduate  Married  Less than $40K  1679    42
197  53  M     Uneducated  Married    $80K - $120K  1461    42
198  68  M    High School  Married  Less than $40K   760    21

[65 rows x 7 columns]

In [11]:
print(df.groupby('성별').mean(numeric_only=True)) # 카테고리에따라 분석

           나이         사용금액       사용횟수
성별
F   49.910256  1320.115385  27.910256
M   49.983607  1352.368852  28.868852

In [12]:
#correlation 값 구하기 (관계구하기)
df[['나이','사용금액']].corr()

            나이      사용금액
나이    1.000000  0.106826
사용금액  0.106826  1.000000

In [16]:
# 기존 list 데이터를 dataframe로 변환가능함
셔츠 = [15, 20, 25]
바지 = [150, 160, 170]

딕셔너리 = {
  '셔츠': [15, 20, 25],
  '바지':[150, 160, 170]
}

# 컬럼명이 셔츠,바지고 해당 값들이 세로로 df값으로 들어감
df2= pd.DataFrame(딕셔너리)
df2

   셔츠   바지
0  15  150
1  20  160
2  25  170

In [ ]:
# pip install pandas

In [46]:
# 숙제
#Q: 남자고 결혼한 사람은 사용금액이 평균적으로 높은지? (남자인데 싱글인 사람에 비해)
# married_men = df.query("성별 == 'M' and 기혼 == 'Married'")
# single_men = df.query("성별 == 'M' and 기혼 == 'Single'")

# married_men_mean = married_men['사용금액'].mean()
# single_men_mean = single_men['사용금액'].mean()

# married_men_mean, single_men_mean

# Q2: 소득이 높을 수록 사용금액 평균이 높은가?
df
df.groupby('소득').mean(numeric_only=True)

                       나이         사용금액       사용횟수
소득
$120K +         51.318182  1282.636364  29.227273
$40K - $60K     50.392857  1319.071429  27.785714
$60K - $80K     47.324324  1384.972973  29.513514
$80K - $120K    49.977778  1357.555556  28.511111
Less than $40K  51.058824  1339.941176  28.823529
Unknown         49.823529  1302.058824  25.470588